IRP/src/Catalogs/DepreciationSchedules/DepreciationSchedules.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>DepreciationSchedules</name>
 <attributes>
  <name>CalculationMethod</name>
  <type>
   <types>EnumRef.DepreciationMethods</types>
  </type>
 </attributes>
 <attributes>
  <name>UsefulLife</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>5</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Rate</name>
  <type>
   <types>DefinedType.typePercent</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>SearchLiteral</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>500</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Enums/DepreciationMethods/DepreciationMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>DepreciationMethods</name>
 <enumValues>
  <name>StraightLine</name>
 </enumValues>
 <enumValues>
  <name>DecliningBalance</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/DepreciationSchedules/ObjectModule.bsl
Procedure BeforeWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure OnWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure BeforeDelete(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	Return;
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	If ThisObject.CalculationMethod <> Enums.DepreciationMethods.StraightLine Then
		CommonFunctionsClientServer.DeleteValueFromArray(CheckedAttributes, "UsefulLife");
	EndIf;
	
	If ThisObject.CalculationMethod <> Enums.DepreciationMethods.DecliningBalance Then
		CommonFunctionsClientServer.DeleteValueFromArray(CheckedAttributes, "Rate");
	EndIf;
EndProcedure
